# UnconstrainableRebarHandle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..UnconstrainableRebarHandle Property
BuiltInFailures..::..RebarFailures Class See Also
---
The rebar handle does not have any constraint targets.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnconstrainableRebarHandle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnconstrainableRebarHandle As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnconstrainableRebarHandle {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace